---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Visible
source: html/139a89a6-9544-4f29-a510-75ddf1367827.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Visible Property

True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
 The default is true.

## Syntax (C#)
```csharp
public bool Visible { get; set; }
```